read_verilog apiodir/*.v pll.v sdram.v
read_verilog apiodir/lib/hdmi_test_pattern/*.v #hdmi

# One single line loads ALL ECP5 primitive definitions (blackboxes + sim models)
read_verilog -lib +/ecp5/*

hierarchy -check -auto-top

#proc; opt; fsm; opt; memory; opt
#show -format png sdram
#techmap; opt

# One single command does everything ECP5-specific
synth_ecp5 #-noabc9

stat
write_json synth_top.json
